Project/Toir/src/Catalogs/гкс_ТехническиеМеста/гкс_ТехническиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ТехническиеМеста</name>
  <attributes>
    <name>МестоПлощадка</name>
    <type>
      <types>CatalogRef.гкс_МестаИПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводПодразделение</name>
    <type>
      <types>CatalogRef.гкс_ЗаводыИПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.гкс_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Эстакада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Здание</name>
    <type>
      <types>CatalogRef.гкс_Здания</types>
    </type>
  </attributes>
  <attributes>
    <name>Этаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отметка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/торо_Переводы/торо_Переводы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Переводы</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Язык</name>
    <type>
      <types>CatalogRef.торо_Языки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/гкс_ТехническиеМеста/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Язык = торо_Локализация.ТекущийЯзыкИБ();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(торо_Переводы.Текст, гкс_ТехническиеМеста.НаименованиеПолное) КАК Текст,
		|	гкс_ТехническиеМеста.НаименованиеПолное КАК Текст2
		|ИЗ
		|	Справочник.гкс_ТехническиеМеста КАК гкс_ТехническиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Переводы КАК торо_Переводы
		|		ПО гкс_ТехническиеМеста.Ссылка = торо_Переводы.ID
		|			И (торо_Переводы.Язык = &Язык)
		|			И (торо_Переводы.Реквизит = ""НаименованиеПолное"")
		|ГДЕ
		|	гкс_ТехническиеМеста.Ссылка = &Ссылка";	
	Запрос.УстановитьПараметр("Ссылка", Данные.Ссылка);
	Запрос.УстановитьПараметр("Язык", Язык);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
	    Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Представление = Выборка.Текст2;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьНаименование(МассивТК)Экспорт
	Для Каждого СМ Из МассивТК Цикл
		Объект = СМ.ПолучитьОбъект();
		
		Объект.НаименованиеПолное = "";
		Если ЗначениеЗаполнено(Объект.МестоПлощадка) Тогда 
			Объект.НаименованиеПолное = Объект.МестоПлощадка;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ЗаводПодразделение) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", " + Объект.ЗаводПодразделение;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Участок) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", " + Объект.Участок;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Эстакада) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", эстакада "+Объект.Эстакада;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Секция) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", опора "+Объект.Секция;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Здание) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", здание "+Объект.Здание;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Этаж) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", этаж "+Объект.Этаж;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Отметка) Тогда 
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", отметка "
			+ Формат(Объект.Отметка, "ЧДЦ=3");
		Иначе
			Объект.НаименованиеПолное = ?(ЗначениеЗаполнено(Объект.НаименованиеПолное),Объект.НаименованиеПолное,"") + ", отметка 0,000";
		КонецЕсли;
		
		Объект.Записать();
	КонецЦикла;
КонецПроцедуры
